package HomeWorks.HomeWorkLesson6;

//Создать класс Flower, который содержит переменные страна производитель, срок хранения в днях, цена.
//Создать классы расширяющие класс Flower
//(для примера, пусть это будут розы, гвоздики, тюльпаны и еще что-то на свой вкус).
//
//Класс Flower должен содержать переменную-счетчик (количество цветов).
//
//Собрать 3 букета (то есть 3 массива типа Flower). В букет может входить несколько цветов разного типа.
//Вывести на консоль количество созданных объектов типа Flower
//используя переменную-счетчик из класса Flower.

public class Flower {

    static int numberOfFlowers;

    String origin;
    int shelfLife;
    int price;
    int count;

}
